{"alias":"the weapon of the faithful","name":"aphelios","role":"marksman","abilities":[{"type":"Passive","name":"the hitman and the seer","description":"Aphelios wields 5 Lunari Weapons made by his sister Alune. He has access to two at a time: one main-hand and one off-hand. Each weapon has a unique Basic Attack and Activated Ability. Attacks and abilities consume a weapon's ammo. When out of ammo, Aphelios discards the weapon and Alune summons the next of the 5.","image":"opgg-static.akamaized.net/images/lol/passive/ApheliosP.png"},{"type":"Q","name":"weapon abilites","description":"Aphelios has 5 different activated abilities, based on his main-hand weapon:\n\nCalibrum (Rifle): Long range shot that marks its target for a long-range follow-up attack.\nSeverum (Scythe Pistol): Run fast while attacking nearby enemies with both weapons.\nGravitum (Cannon): Root all enemies slowed by this weapon.\nInfernum (Flamethrower): Blast enemies in a cone and attack them with your off-hand weapon.\nCrescendum (Chakram): Deploy a sentry that shoots your off-hand weapon.","image":"opgg-static.akamaized.net/images/lol/spell/ApheliosQ_ClientTooltipWrapper.png"},{"type":"W","name":"phase","description":"Aphelios swaps his main-hand gun with his off-hand gun, replacing his basic attack and activated ability.","image":"opgg-static.akamaized.net/images/lol/spell/ApheliosW.png"},{"type":"E","name":"weapon queue system","description":"Aphelios has no third ability. This slot shows the next weapon Alune will give him. Weapon order begins fixed but may change over game time -- when a weapon is out of ammo it goes to the end of the order.","image":"opgg-static.akamaized.net/images/lol/spell/ApheliosE_ClientTooltipWrapper.png"},{"type":"R","name":"moonlight vigil","description":"Fire a concentrated blast of moonlight that explodes on enemy champions. Applies the unique effect of Aphelios' main-hand gun.","image":"opgg-static.akamaized.net/images/lol/spell/ApheliosR.png"}],"skins":["https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Aphelios_0.jpg","https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Aphelios_1.jpg"],"region":"Targon","champion_image":"opgg-static.akamaized.net/images/lol/champion/Aphelios.png"}