{"alias":"the voidreaver","name":"kha'zix","role":"assassin","abilities":[{"type":"Passive","name":"unseen threat","description":"Nearby enemies that are Isolated from their allies are marked. Kha'Zix's abilities have interactions with Isolated targets.\n\nWhen Kha'Zix is not visible to the enemy team, he gains Unseen Threat, causing his next basic attack against an enemy champion to deal bonus magic damage and slow them for a few seconds.","image":"opgg-static.akamaized.net/images/lol/passive/Khazix_P.png"},{"type":"Q","name":"taste their fear","description":"Deals physical damage to the target. Damage increased on Isolated targets. If he chooses to Evolve Reaper Claws, this refunds a percent of it's cooldown against Isolated targets. Kha'Zix also gains increased range on his basic attacks and Taste Their Fear.","image":"opgg-static.akamaized.net/images/lol/spell/KhazixQ.png"},{"type":"W","name":"void spike","description":"Kha'Zix fires exploding spikes that deal physical damage to enemies hit. Kha'Zix is healed if he is also within the explosion radius. If he chooses to Evolve Spike Racks, Void Spike now fires three spikes in a cone, slow enemies hit, and reveals enemy champions hit for 2 seconds. Isolated targets are slowed for extra.","image":"opgg-static.akamaized.net/images/lol/spell/KhazixW.png"},{"type":"E","name":"leap","description":"Kha'Zix leaps to an area, dealing physical damage upon landing. If he chooses to Evolve Wings, Leap's range increases by 200 and the cooldown resets on champion kill or assist.","image":"opgg-static.akamaized.net/images/lol/spell/KhazixE.png"},{"type":"R","name":"void assault","description":"Each rank allows Kha'Zix to evolve one of his abilities, giving it a unique additional effect. When activated, Kha'Zix becomes Invisible, triggering Unseen Threat and increasing Movement Speed. If he chooses to Evolve Adaptive Cloaking, Void Assault gains increased Invisibility duration, and an additional use.","image":"opgg-static.akamaized.net/images/lol/spell/KhazixR.png"}],"skins":["https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Khazix_0.jpg","https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Khazix_1.jpg","https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Khazix_2.jpg","https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Khazix_3.jpg","https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Khazix_4.jpg","https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Khazix_11.jpg"],"region":"The Void","champion_image":"opgg-static.akamaized.net/images/lol/champion/Khazix.png"}