{"alias":"the redeemer","name":"senna","role":"marksman","abilities":[{"type":"Passive","name":"absolution","description":"When units die near Senna, their souls are periodically trapped by the Black Mist. Senna can attack these souls to free them, absorbing the Mist that held them in death. Mist fuels her Relic Cannon's power with increased Attack Damage, Attack Range, and Critical Strike Chance. \n\nAttacks from Senna's Relic Cannon take longer to fire, deals bonus damage , and briefly grant her a portion of her target's Movement Speed.","image":"opgg-static.akamaized.net/images/lol/passive/Senna_Passive.Senna.png"},{"type":"Q","name":"piercing darkness","description":"From the twin barrels of her Relic Cannon, Senna fires a unified beam of light and shadow through a target, healing allies and damaging enemies.","image":"opgg-static.akamaized.net/images/lol/spell/SennaQ.png"},{"type":"W","name":"last embrace","description":"Senna sends forth a wave of Black Mist. If it hits an enemy it latches onto them hungrily, rooting them and everything nearby after a brief delay.","image":"opgg-static.akamaized.net/images/lol/spell/SennaW.png"},{"type":"E","name":"curse of the black mist","description":"Senna draws the Mist she has stored in her weapon into a storm around her, embracing darkness and becoming a wraith within. Allies who enter the area are camouflaged and also appear as wraiths as the Mist shrouds them. Wraiths gain increased movement speed, are unselectable, and hide their identities.","image":"opgg-static.akamaized.net/images/lol/spell/SennaE.png"},{"type":"R","name":"dawning shadow","description":"Senna calls upon the relic stones of fallen Sentinels, splitting her relic cannon into a holy array of shadow and light. She then fires a global beam that shields allies from harm, while damaging enemies caught in the center.","image":"opgg-static.akamaized.net/images/lol/spell/SennaR.png"}],"skins":["https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Senna_0.jpg","https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Senna_1.jpg","https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Senna_9.jpg"],"region":"Runeterra","champion_image":"opgg-static.akamaized.net/images/lol/champion/Senna.png"}